def caching_fibonacci():
    # Створюємо замикання для функції Фібоначчі з кешуванням
    cash = {}  # Словник для зберігання вже обчислених чисел Фібоначчі

    def fibonacci(n):
        """
        Обчислює n-те число Фібоначчі з використанням рекурсії та кешування.
        :param n: порядковий номер числа Фібоначчі (n >= 0)
        :return: n-те число Фібоначчі
        """
        if n <= 0:
            return 0  # Визначення для n <= 0
        if n == 1:
            return 1  # Базовий випадок рекурсії
        if n in cash:
            return cash[n]  # Повертаємо значення з кешу, якщо воно вже обчислене

        # Рекурсивне обчислення та збереження результату в кеш
        cash[n] = fibonacci(n - 1) + fibonacci(n - 2)
        return cash[n]

    return fibonacci


fib = caching_fibonacci()

if __name__ == '__main__':
    # Використовуємо функцію fibonacci для обчислення чисел Фібоначчі
    print(fib(10))  # Виведе 55
    print(fib(15))  # Виведе 610